#created by CyberCraft Studio for CyberCraft History 4.15.2024
import datetime
import wikipedia
from telegram import Bot, Update
from telegram.ext import Updater, CommandHandler, CallbackContext
import os
    

# Встановіть мову для Вікіпедії
wikipedia.set_lang("uk")

TOKEN = 'hmmmmmmmmmmmmmmmmmm'
CHANNEL_ID = '@cybercraft_business'  # Ім'я вашого каналу

# Ключові слова для пошуку на Вікіпедії
KEYWORDS = [
    'гетьманщина', 'УСРС', 'УПА', 'козаки', 'УСС', 'УНР', 'ОУН', 
    'карпатська Україна', 'центральна рада', 'унія', 'полк', 
    'український полковник', 'кошовий отаман', 'мирний договір', 
    'донбас', 'Хасекі Хюррем-султан', 'революція на граніті', 
    'революція гідності', 'майдан', 'наддніпрянська Україна', 
    'Скороподський', "Богдан Хмельницький",
"Іван Сірко",
"Петро Сагайдачний","Михайло Дорошенко",
"Іван Мазепа",
"Пилип Орлик",
"Дмитро Вишневецький",
"Яків Потоцький","Олексій Гордієнко","Іван Петрович Суховейський","Максим Кривонос",
"Іван Богун","Яків Острянин","Микола Копиленко","Михайло Калиновський","Петро Конашевич-Сагайдачний","Іван Підкова",
"Олексій Трубецькой","Максим Залізняк","Семен Палій","Іван Виговський","Остромира","Василь Злобинський","Іван Горбунов-Шевченко",
"Іван Петрович Гордієвський","Петро Дорошенко","Микола Жмудський","Степан Попель","Іван Виган","Семен Мазепа","Іван Самойлович",
"Іван Яковенко","Яків Чернихівський","Олександр Меншиков","Петро Калиновський","Микола Павленко","Яків Пшолка","Степан Руданський",
"Іван Скоропадський","Ян Тарновський","Григорій Грушевський (історик)","Михайло Грушевський (політик)","В'ячеслав Чорновіл","Леся Українка",
"Тарас Шевченко","Панас Мирний","Михайло Коцюбинський","Іван Франко","Григорій Сковорода","Олександр Олесь","Юрій Яновський",
"Володимир Винниченко","Іван Котляревський","Леонтій Калиновський","Панас Сотников","Олекса Довбуш","Стефан Чарнецький","Богдан-Ігор Антонич",
"Василь Стус","Іван Багряний","Василь Іванович Мазепа","Павло Скоропадський","Олександр Мартинович","Дмитро Тимошевський","Олександр Чернеча","Григорій Ляташевський",
"Іван Підкова","Микола Миклашевський","Павло Полуботок","Данило Нечай","Іван Мазуркевич","Олександр Корнійчук","Микола Левицький",
"Володимир Винниченко","Григорій Заткович","Леонід Первомайський","Петро Гончар","Сергій Згуровський","Іван Полторацький",
"Андрій Мельничук","Михайло Березовський","Олександр Білецький","Сергій Єфремов","Валерій Чорний","Анатолій Соломін","Євген Коновалець",
"Олег Шаблій","Іван Сірко (гетьман УПА)","Іван Липа","Микола Литвин","Іван Стець","Леонід Кравчук","Віталій Масол","Віктор Ющенко","Віктор Янукович",
"Петро Порошенко","Володимир Зеленський","Ярослав Мудрий","Левко Лук'яненко","Роман Шухевич","Олег Оліньчук","Юрій Клапоух","Валерій Лобановський","Андрій Шевченко",
"Дмитро Чижевський","Микола Мельник","Ігор Костенко",
"Василь Іванчук""Іван Сокул","Павло Слободян","Олексій Андрухович","Тарас Прохасько","Сергій Жадан","Юрій Андрухович","Олена Цвєтаєва","Марина Цвєтаєва","Олена Пінчук",
"Олена Бондаренко","Анна Качкаєва","Тетяна Матвієнко","Ірина Фаріон","Олег Сенцов","Надія Савченко","Степан Бандера",
"Роман Шухевич","Юрій Хмель","Володимир В'ятрович","Андрій Шептицький","Петро Могила","Іларіон Охрімович","Григорій Сковорода",
"Петро Могила","Яків Громадський","Олекса Гавриш","Михайло Хоменко","Іван Піддубний","Василь Верес","Петро Нестеренко","Марко Вовчок","Леся Українка","Тарас Шевченко",
"Михайло Грушевський","Іван Франко","Григорій Сковорода","Олександр Довженко","Іван Багряний",
"Володимир Короленко",
"Левко Ревуцький",
"Михайло Коцюбинський",
"Панас Мирний",
]

ALLOWED_USERS = ['mishaddv3', 'Mr_maderator_YT']  # Список дозволених користувачів


INDEX_FILE = 'index.txt'  # Файл для зберігання індексу останнього ключового слова

def read_last_index():
    if not os.path.exists(INDEX_FILE):
        return -1
    with open(INDEX_FILE, 'r') as f:
        return int(f.read().strip())

def write_last_index(index):
    with open(INDEX_FILE, 'w') as f:
        f.write(str(index))

def get_today_info(keyword_index):
    today = datetime.datetime.now().strftime("%B %d")
    try:
        keyword = KEYWORDS[keyword_index]
        page = wikipedia.page(keyword)
        summary = wikipedia.summary(keyword, sentences=10)
        if today in page.content:
            return f"{summary}"
        else:
            return f"{summary}"
    except (wikipedia.exceptions.DisambiguationError, wikipedia.exceptions.PageError):
        pass
    return f"{keyword_index}. Інформація про українську історію відсутня."

def send_info(context: CallbackContext):
    last_index = read_last_index()
    if last_index == len(KEYWORDS) - 1:
        return
    today_info = get_today_info(last_index + 1)
    context.bot.send_message(chat_id=CHANNEL_ID, text=today_info)
    write_last_index(last_index + 1)

def start(update: Update, context: CallbackContext):
    update.message.reply_text("Бот почав роботу! Щоб відправити інформацію про сьогодні в канал, використовуйте команду /send_info.")

def send_info_command(update: Update, context: CallbackContext):
    user_id = update.effective_user.username
    if user_id in ALLOWED_USERS:
        send_info(context)
        update.message.reply_text("Інформацію відправлено до каналу.")
    else:
        update.message.reply_text("Ви не маєте прав для відправки інформації в канал.")

def main():
    updater = Updater(token=TOKEN)
    dp = updater.dispatcher
    
    dp.add_handler(CommandHandler("start", start))
    dp.add_handler(CommandHandler("send_info", send_info_command))

    # Запускаємо відправку інформації о 10:00
    job_queue = updater.job_queue
    job_queue.run_daily(send_info, time=datetime.time(hour=10, minute=0))

    updater.start_polling()
    updater.idle()

if __name__ == '__main__':
    main()
